EDT/МПСтриж/src/InformationRegisters/РассылкаСМС/РассылкаСМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкаСМС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСМС</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПроизошлаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/CommonModules/СМСИнформированиеСервер/Module.bsl
&НаСервере
Процедура ЛогироватьОтправленноеСМСНаСервере(СтрокаСМС, Рейс, СтрокаДанных, ДатаОтправки, ДатаПолучения = "", Ошибка = Ложь, ТекстОшибки = "") Экспорт
	Наб = РегистрыСведений.РассылкаСМС.СоздатьНаборЗаписей();
	ТекВр = ТекущаяДата();
	
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Рейс.Установить(Рейс);
	Наб.Отбор.Заказ.Установить(СтрокаДанных.Заказ);
	Наб.Отбор.Шаблон.Установить(СтрокаДанных.ШаблонСМС);
	
	Нов = Наб.Добавить();
	Нов.Период = ТекВр;
	Нов.Рейс = Рейс;
	Нов.Заказ = СтрокаДанных.Заказ;
	Нов.Шаблон = СтрокаДанных.ШаблонСМС;
	Нов.Транспорт = СтрокаДанных.Транспорт;
	Нов.ДатаОтправки = ДатаОтправки;
	Нов.ДатаПолучения = ДатаПолучения;
	Нов.ТекстСМС = СтрокаСМС;
	Нов.ПроизошлаОшибка = Ошибка;
	Нов.ТекстОшибки = ТекстОшибки;
	Нов.Телефон = СтрокаДанных.ТелефонКлиента;
	
	Наб.Записать();
КонецПроцедуры
